/**
 * Seed the database
 */
var db = require('../database/index')('../database/models/*.js');
var app = require('../app');

// create some tags
db.connect(app.get('db')).connection.once('open', function() {
	db.Tag.find({}).exec(function(err, tags) {
		console.log(tags);
		const posts = [{
			title: 'Быйыл Кыргызстан Кытайга алча менен коон экспорттойт',
			about: 'Кыргызстандын айыл чарба тармагындагы экспорт 129 пайызга өстү',
			image: 'news0',
			source: 'https://sputnik.kg/economy/20170531/1033612622/kyrgyzstanga-kytajga-alcha-menen-koondu-ehksporttojt.html',
			content: `2017-жылдын биринчи кварталында Кыргызстандын айыл чарба тармагындагы экспорту 129 пайызга өскөн. Бул тууралуу айыл чарба, тамак-аш өнөр жайы жана мелиорация министринин орун басары Эркин Чодуев маалымат жыйында билдирди.
Экспорттук көрсөткүч мал чарбачылыгында жана кайра иштетүү тармагында сыртка чыгарылган азыктардын көлөмү жогорулаганынан улам өскөн. "Быйыл экспорттук өсүү былтыркыга караганда бир топ жакшы болору күтүлүүдө. Анткени 2017-жылы эки өлкө ортосунда түзүлгөн келишимдерге ылайык, Кыргызстан Кытайга алча менен коон экспорттой баштайт", — деди Чодуев. © SPUTNIK / КОНСТАНТИН ЧАЛАБОВ Катарлыктар Кыргызстанда өндүрүлгөн суу, эт жана бал сатып алууга даяр Ал ошондой эле экпорттук потенциалдын жогорулашын өкмөттүн "Айыл чарба тармагын каржылоо-5" долбоорун ийгиликтүү ишке ашырып жатканы менен байланыштырды. Долбоор алкагында жеңилдетилген насыя алган дыйкан-фермерлердин саны көбөйүп, алар өндүргөн азыктарын сыртка чыгара баштаган. Чодуев андан сырткары быйыл төө буурчак менен пахтаны жылдагыдан көбүрөөк экспорттоого да өзгөчө көңүл буруларын кошумчалады.`
		}, {
			title: 'Өлкөнүн 26 ишканасына Казакстан аймагында соода кылууга жол ачылды',
			about: 'Буга чейин ишканалар товарларын Казакстандын түштүк облустарына гана жеткирип турган.',
			image: 'news1',
			source: 'https://sputnik.kg/economy/20170601/1033641125/olkonun-26-ishkanasyna-kazakstanga-sooda-zhugurtuugo-uruksat-berildi.html',
			content: `Кыргызстандын 26 өндүрүш ишканасы Казакстандын бардык аймактарына соода жүргүзүү укугуна ээ болду. Бул тууралуу Ветеринардык жана фитосанитардык коопсуздук боюнча мамлекеттик инспекциянын маалымат кызматы билдирди.
"Бул боюнча Казакстандын Айыл чарба министрлигинин ветеринардык көзөмөлдөө комитети менен сүйлөшүүлөр болуп өттү. Жыйынтыгында Евразия экономика биримдигинин бирдиктүү реестрине киргизилген кыргызстандык 26 ишкана Казакстандын бардык аймагына өз товарларын сатууга мүмкүнчүлүк алды", — деп айтылат маалыматта. Буга чейин ишканалар продукцияларын Казакстандын түштүк облустарына гана чыгарып турган.`
		}, {
			title: 'Багбандар жеңилдетилген насыя ала алышат — шарттары',
			about: 'Өнүктүрүү фонду жеңилдетилген насыяны алуу шарттары менен талаптарын фермерлерге түшүндүрүп берди.',
			image: 'news2',
			source: 'https://sputnik.kg/economy/20170531/1033616531/bagbanchy-fermerler-uchun-zhenildetilgen-nasyya.html',
			content: `Орус-кыргыз өнүктүрүү фонду багбан-фермерлер үчүн жеңилдетилген насыя берүүнү иштеп чыкты. Бул тууралуу фонддун маалымат кызматы билдирди.

Насыяны фондго өнөктөш банктардан алса болот. Насыянын бул түрү да чакан жана орто бизнести колдоо үчүн берилет. 1 миллион долларды эң узак 5 жылдык мөөнөткө алса болот. Пайыздык коюм сом менен жылына 12 пайыз, доллар менен 5 пайызды түзөт. © SPUTNIK / ТАБЫЛДЫ КАДЫРБЕКОВ Касенов: Бабановдун өнүктүрүү фонддон алган акчасын эл аралык компания көзөмөлдөйт Насыя алуу үчүн мөмө-жемиш бактарын отургузуп, аларды иштеткен багбандар кайрылса болот. Фермелерге карата коюлган негизги талап көчөттөрдү отургуза турчу жер тилкеси болуп, багбанчылык боюнча окуудан өтүшү шарт. Ал эми көчөттөрдү жеткирчү чарба менен компаниялардын бул багыттагы тажрыйбасы 3-5 жылдан кем болбошу керек. Ошондой эле тажрыйбалуу адистер жана иштеп жаткан багы болушу да талаптардын бири. Андан сырткары сунуштаган көчөттөрдүн 80 пайызы өсүп кетет деген кепилдик менен фермерге үч жыл бою кеп-кеңеш берип турушу керек.`
		}, {
			title: 'Өкмөт ипотекалык насыя алуунун шартын жеңилдетүүгө ниеттенип жатат',
			about: 'Ипотекалык компания өлкөнүн ар бир райондук жана облустук борборлорунда көп кабаттуу турак жай куруу үчүн инвестиция тартууну максаттап жатат.',
			image: 'news3',
			source: 'https://sputnik.kg/society/20170610/1033783920/ipoteka-aluu-zhenildejt.html',
			content: `Өкмөт мамлекеттик ипотекалык компаниянын ишин жакшыртууну көздөп жатат. Мындай билдирүүнү биринчи вице-премьер Мухамметкалый Абулгазиев аталган маселе талкууланган ведомстволор аралык комиссиянын жыйынында жасалганын өкмөттүн маалымат кызматы билдирди.
Ал өкмөт ипотекалык насыя алуунун шартын жеңилдетүүнү карай турганын айтты. "Насыя алуунун жана карыздан кутулуунун шарты тууралуу документтерди толтуруу ыраатын ар бир жаран жакшы билиши керек. Бул "Мамлекеттик ипотекалык компания" ишканасынын эле көйгөйү эмес, буга калк менен тыгыз иштеген жергиликтүү бийлик да баш оорутушу керек", — деди Абулгазиев. Бүгүнкү күндө компаниянын уставдык капиталы 1,3 миллиард сосду түзөт. Насыяга учурда 1300 жаран ээ болгон. Ипотека менен алынган турак жайдын көбү Бишкек менен Ош шаарларында жайгашкан. Өкмөт ипотекалык компания өлкөнүн ар бир райондук жана облустук борборлорунда көп кабаттуу турак жай куруу үчүн инвестиция тартууну максаттап жатканын белгиледи.`,
		}]

		for (post of posts) {
			var instance = new db.Post({
				title: post.title,
				about: post.about,
				image: post.image,
				source: post.source,
				content: post.content,
				tags: post.tags,
				axilary_date: new Date().toLocaleString('ru', {
		          month: 'long',
		          day: 'numeric',
		          hour: 'numeric',
		          minute: 'numeric',
		          year: 'numeric'
		        })
			});
			
			instance.save(function (err) {
				if (err) {
					console.log(err);
				}
				console.log('Posts seeded',err);
				// saved!
			});
		}
	});
});
