/**
 * Seed the database
 */
var db = require('../database/index')('../database/models/*.js');
var app = require('../app');

// create some tags
db.connect(app.get('db')).connection.once('open', function() {
	db.Tag.find({}).exec(function(err, tags) {
		console.log(tags);
		const posts = [{
			title: 'Манчестер Юнайтед" эң кымбат футбол клуб деп табылды',
			about: 'Англиянын "Манчестер Юнайтед" футболдук клубу соңку беш жылдан бери биринчи ирет дүйнөдөгү эң кымбат клуб деп табылып, баасы боюнча испаниялык "Реал Мадридди" артка калтырды.',
			image: 'news0',
			source: 'http://www.bbc.com/kyrgyz/world-40197717',
			content: `Англиянын "Манчестер Юнайтед" футболдук клубу соңку беш жылдан бери биринчи ирет дүйнөдөгү эң кымбат клуб деп табылып, баасы боюнча испаниялык "Реал Мадридди" артка калтырды.
Forbes рейтинги боюнча "Манчестер Юнайтед" футбол клубунун азыркы учурдагы баасы 3,689 млрд долларды түзөт.
Рейтинг боюнча экинчи орунда "Барселона" турат. Анын баасы 3,635 млрд доллар деп бааланган. "Реал" клубу үчүнчү орунга чыкты.
Дүйнөдөгү эң кымбат футбол клубдарынын бешилтигине мюнхендик "Бавария" жана англиялык "Манчестер Сити" клубдары кирген.
Ал эми он команданын ичине төрт англиялык клуб - "Арсенал" (алтынчы орунда), "Челси" (жетинчи орунда), "Ливерпуль" (сегизинчи орунда) "Тоттенхэм" (онунчу орунда) кымбат клубдар болуп табылган. Тогузунчу орунга туриндик "Ювентус" чыкты.
Бир жыл мурун "Манчестер Юнайтед" үчүнчү орунда аталып, 3,317 млрд долларга бааланган. Ал эми "Реал" 3,645 млрд долларга бааланып биринчи орунда турган болчу.
Андан сырткары "Манчестер Сити" лондондук "Арсеналдан" төмөн жайгашкан эле. Калган тизме өткөн жылдагыдай эле өзгөрүүсүз болду.
"Манчестер Юнайтед" бул сезондо англиялык премьер-лигада болгону алтынчы орунга чыга алды. Бирок ошого карабастан үч кубокту утуп алды. Алар Англиянын суперкубогу, Лиганын кубогу жана Европа лигасын утту.
Ал эми "Реал" Испания чемпионатын жана европалык эң престиждүү саналган Чемпиондор лигасын утуп алды. Августтун башында "Реал" менен "Манчестер Юнайтед" Европанын супер кубогу үчүн беттеш өткөрөт. (AbA)`,
		}, {
			title: 'Катар бойкот жарыялаган коңшуларына карата пикирин билдирди',
			about: 'Катардын бийлиги коңшулаш араб өлкөлөлөрү менен дипломатиялык жаңжалда өз позициясынан чегинүү ниети жок деп билдирди өлкөнүн Тышкы иштер министри Мохаммед Абдель Рахман аль-Тани.',
			image: 'news1',
			source: 'http://www.bbc.com/kyrgyz/world-40215051',
			content: `Катардын бийлиги коңшулаш араб өлкөлөлөрү менен дипломатиялык жаңжалда өз позициясынан чегинүү ниети жок деп билдирди өлкөнүн Тышкы иштер министри Мохаммед Абдель Рахман аль-Тани.
"Биз багынбайбыз жана сырткы көз карандысыз саясатыбыздан биз эч качан баш тартпайбыз»,-деген министр.
Анын айтымында бул кризисти чечүү үчүн дипломатиялык жолдорду издөө зарыл жана аскердик кийгилишүүнүн такыр кереги жок.
Тогузунчу өлкө Катар менен дипломатиялык мамилесин токтотту
Катардын коңшулары аба мейкиндигин жабышты
Катардын коңшулары менен мамилесинин бузулушу эмнеге алып келет?
Тышкы иштери министри Аль-Тани ошондой эле Иран Катарга өзүнүн үч деңиз портун суу жана азык-түлүк алып келүү үчүн колдонуп турууну сунуштаганын айтты. Бирок азырынча катарлык бийлик бул сунушту кабыл алган эмес.
Министр буга чейин Катар бир да жолу мындай башка өлкөлөр менен душмандашкан мамилеге туш болгон эмес эле деп белгиледи.
Апта башында тогуз өлкө Катарды террордук уюмдарды колдойт экстремисттик идеологияны пропагандалайт деп айыптап, дипломатиялык мамилелерин үзгөнүн билдирип чыккан.
Бейшембиде Бахрейн жана Бириккен Араб эмираттары өз жарандарына Катарды колдогон кандай гана аракет болбосун айыпка жыгылып жана беш жылга чейин камалышы мүмкүн экенин эскертти.
Катар бийлиги өзүнөн кол үзүүгө себеп болгон жагдайларды далилсиз доомат катары атап, бул «өлкөнүн жана жарандардын жашоо турмушуна эч кандай таасир этпейт» деди.
Бейшембиде белгилүү болгондой Катардын Тышкы иштер министри 9-10-июнда Москвага расмий иш сапары менен келүүнү пландап жатат. Ал жерде орус кесиптеши Сергей Лавров менен сүйлөшүүлөрдү жүргүзмөкчү.
Би-би-синин дипломатия маселелери боюнча баяндамачысы Жеймс Роббинсдин белгилөөсүндө, Орусиянын кийгилишүүсү кырдаалды андан бетер татаалдаштыруусу мүмкүн.
Шейшембиде АКШ президенти Дональд Трамп араб өлкөлөрүнүн Катар менен дипломатиялык мамилесин токтотконун өзүнүн Жакынкы Чыгышка болгон иш сапары менен түздөн-түз байланыштуу деп билдирди. Трамптын пикиринде Катарга көрсөтүлүп жаткан кысым "терроризм коркунучунун бүтүшүнүн" алгачкы этабы болуп калышы мүмкүн. (AbA)`,
		}, {
			title: 'Сеул: КЭДР кемеге каршы колдонулган ракетасын сынады',
			about: 'КЭДР кемеге каршы колдонулган бир нече ракетасын сыноодон өткөрүп, ал 200 чакырымдай учуп барып деңизге түштү деп кабарлады Түштүк Кореянын куралдуу күчтөрү.',
			image: 'news2',
			source: 'http://www.bbc.com/kyrgyz/world-40197716',
			content: `КЭДР кемеге каршы колдонулган бир нече ракетасын сыноодон өткөрүп, ал 200 чакырымдай учуп барып деңизге түштү деп кабарлады Түштүк Кореянын куралдуу күчтөрү.
Түштүк кореялык армиянын маалыматына караганда ракеталар КЭДРдин чыгыш жээктеринен атылган. Муну менен КЭДР ири аскер кемелерин жок кылууга жөндөмдүү экенин демонстрациялап жатат дейт түштүк коерялык аскер адистери.
Акыркы апталарда АКШ Корей жарым аралында өзүнүн аскер кемелеринин санын көбөйтүп жатат. 5-июнда КЭДР жээктерин көздөй Сан-Диегодон америкалык үчүнчү аскер учагын тарткан "Нимиц" кемеси сапарга чыкканын ММКлар жазууда. Буга чейин жарым аралга "Карл Винсон" жана "Рональд Рейган" кемелери келген.
КЭДР дүйнө коомчулугунун айыптоолоруна карабастан баллистикалык ракета сыноосун улантып келүүдө. Апрелде эки жолу сыноо өткөрүп, эки ракета тең учуп чыккан учурунда эле жарылып кеткен.
Дагы бир ракета сыноосун 14-майда өткөрдү. Түндүк Кореянын Борбордук телеграф агенттиги сыноо ийгиликтүү болгонун жазды. Муну АКШ жана Түштүк Корея бийлиги кескин айыптаган билдирүү тараткан. Июнь айында БУУнун Коопсуздук кеңеши Пхеньянга карата санкцияларын кеңейтти. (AbA)`,
		}, {
			title: 'Шайлоодо социалдык желелер ролу кандай болот?',
			about: 'Кыргызстанда интернетти үзгүлтүксүз такай колдонгон жарандар саны 2 миллион 600 миң адамды түзөт. Канчалык таң калыштуу болбосун бирок кыргызстандыктар эң көп катталган социалдык желе бул - ВКонтакте. Андан кийин колдонуучулар саны боюнча Одноклассники жана Фейсбук турат.',
			image: 'news3',
			source: 'http://www.bbc.com/kyrgyz/kyrgyzstan-40201619',
			content: `SMM боюнча адис Светлана Марголис Кыргызстанда кайсы социалдык желе популярдуу дегенде офисте иштегендер "ал Фейсбук болуш керек" деп ойлошу мүмкүн дейт. Бирок айтымында, чындап келгенде кыргызстандыктар эң көп катталган желе бүгүнкү күнү бул - ВКонтакте.
"ВКонтакте желесинде 1 миллион 300 миң кыргызстандык колдоонучу бар деп эсептелет. Бирок ал колдонуучулардын рекламага реакциясы абдан чабал. Экинчи орунда Одноклассники социалдык түйүнү турат, кыргызстандык колдоонуучулар саны ал жакта 730 миңге жетет. Биз биринчи деп ойлогон Фейсбук үчүнчү гана орунда турат, аны 440 миң кыргызстандык колдонот. Инстаграм социалдык желе катары каралбайт, бирок ошентсе да ал мобилдик тиркемеде жарым миллион кыргызстандыктар отурат",- деди Светлана Марголис.
Ал өлкөдө интернеттин жайылышы боюнча статистика чаржайыт экенин айтып, бул сандарды сырткы ченемдерге таянып келтирип жаткандыгын билдирди.
Социалдык медиа салттуу ММК ордун басууда
Кыргызстанда 15-октябрга президенттик шайлоо белгиленди. Талапкерлер күн алдын эле үгүт, шайлоо кампанияларын баштап, азырынча электорат көңүлүн социалдык желе аркылуу алуу аракетинде.
Саясат тануучу Денис Бердаков социалдык медиа барган сайын саясатчылар үчүн салттуу массалык маалымат каражаттарынын ордун басууда дейт. Өзгөчө жеке медиа ресурсу жок саясатчыларга бул табылга болду.
Денис Бердаков социалдык медиа барган сайын саясатчылар үчүн салттуу массалык маалымат каражаттарынын ордун басууда дейт.Сүрөттүн автордук укугуDENIS BERDAKOV
Image caption
Денис Бердаков социалдык медиа барган сайын саясатчылар үчүн салттуу массалык маалымат каражаттарынын ордун басууда дейт.
"Учурда социалдык медианы активдүү колдонгон талапкерлер Темир Сариев менен Өмүрбек Бабанов болууда. Бабановдун ММКлары бар экенин билебиз, ошентсе деле ал социалдык медиада активдүү. Сариев болсо шайлоо кампаниясын социалдык медиага басым жасап жүргүзүүдө. Бул жерде ал социалдык медианы жакшы көргөндөн эмес, ал аркылуу алда канча арзан жана натыйжалуу болгондуктан ага артыкчылык берип атат десек болот",- дейт саясат талдоочу.
Бирок айтымында айрым саясатчылар жана президентикке талапкерлер социалдык медиа ролун азырынча анча аңдай электей.
"Түштүкчүл саясатчыларды: Келдибеков, Мадумаров жана Ташиевди социалдык медиадан көрө албай жатабыз. Социалдык медиадагы аккуанттарын алар бир аз чабалыраак алып барып, бир аз эски формациядагы саясатчылар болуп жатышат. Бирок шайлоочулардын көбү Кыргызстандын түштүгүндө экенин эске алганда жана алардын баары массалык түрдө социалдык медиага келе турган болсо, бизде башкача доор башталат",- Денис Бердаков
Шайлоо реалдуулууктары өзгөрдү
Жогорку Кеңеш депутаты Аида Касымалиева социалдык технологиялар өнүккөнү шайлоо процесстери да өзгөрүүлөргө дуушар болду дейт. Электорат жашарып, аларга карата мамиле да өзгөрүүгө муктаж.
"Кадимки шайлоочуларга, айылдагы дейли, мамилени ошол эле Фейсбукта жасаса болбойт. Өзүнчө отуруп аларды изилдеп чыгыш керек. Алар кандай талапкерди каалайт, эмнеге кызыгат? Анан ошол изилдөөлөр негизинде башкача бир пиар кампанияларды ойлоп табыш керек",- деди депутат.
Бааамында шайлоодо учурда эки реалдуулук пайда болду: кадимки элеттеги интернетке катышы жок шайлоочулар жана интернет колдонуучулары.
Жогорку Кеңеш депутаты Аида Касымалиева социалдык технологиялар өнүккөнү шайлоо процесстери да өзгөрүүлөргө дуушар болду дейт.Сүрөттүн автордук укугуOFFICIAL
Image caption
Жогорку Кеңеш депутаты Аида Касымалиева социалдык технологиялар өнүккөнү шайлоо процесстери да өзгөрүүлөргө дуушар болду дейт.
"Бизде азыр шайлоодо эки реалдуулук бар. Бул жанагы айылдагы шайлоочулар. Алар биздин бала, биздин уруудан чыккан, биздин жерден деген принциптерге таянып же ал биздин маселелерди чечет деген ойдон барып шайлашат. Аларды реалдуу шайлоочулар дейли, бирок дагы бир чоң интернет деген реалдуулук бар. Көбү интернетте жүргүзүлгөн пиар кампаниялар, лайктар эчтекеге жарабайт, шайлоого келгенде алардын ролу чоң эмес деп буга чейин айтып келишкен. Бирок анын ролу абдан чоң. Ошол эле Фейсбуктагы посттор, социалдык түйүндөрдө жайылган маалыматтар имиджди түзөт. Журналисттер ошол жактан маалымат алышат жана ал айылдагы шайлоочуларга таасирин берет",- деди депутат.
Күздө өтө турган президенттик шайлоого баруу ниетин азырынча 10 чакты талапкер билдирди.`,
		}]

		for (post of posts) {
			var instance = new db.Post({
				title: post.title,
				about: post.about,
				image: post.image,
				source: post.source,
				content: post.content,
				tags: post.tags,
				axilary_date: new Date().toLocaleString('ru', {
		          month: 'long',
		          day: 'numeric',
		          hour: 'numeric',
		          minute: 'numeric',
		          year: 'numeric'
		        })
			});
			
			instance.save(function (err) {
				if (err) {
					console.log(err);
				}
				console.log('Posts seeded',err);
				// saved!
			});
		}
	});
});
